三层交换机配置DHCP

步骤一、SW1配置VLAN
Switch>en
Switch#vl da
Switch(vlan)#vl 10
Switch(vlan)#vl 20
Switch(vlan)#vl 30
Switch(vlan)#exit
Switch#conf t
Switch(config)#in ra f0/1-10
Switch(config-if-range)#sw mo ac
Switch(config-if-range)#sw ac vl 10
Switch(config-if-range)#exit

Switch(config)#in ra f0/11-15
Switch(config-if-range)#sw mo ac
Switch(config-if-range)#sw ac vl 20
Switch(config-if-range)#exit

Switch(config)#in vl 30
Switch(config-if)#in ra f0/16-23
Switch(config-if-range)#sw mo ac
Switch(config-if-range)#sw ac vl 30
Switch(config-if-range)#exit
Switch(config)#ho SW1

SW1(config)#in f0/24
SW1(config-if)#sw mo tr
SW1(config)#end
SW1#sh vl br


步骤二、SW0配置VLAN

Switch>
Switch>en
Switch#vl da
Switch(vlan)#vl 10
Switch(vlan)#vl 20
Switch(vlan)#vl 30
Switch(vlan)#exit

Switch#conf t
Switch(config)#ho SW0
SW0(config)#ip routing

SW0(config)#in vl 10
SW0(config-if)#ip ad 192.168.10.1 255.255.255.0
SW0(config-if)#no sh
SW0(config-if)#exit

SW0(config)#in vl 20
SW0(config-if)#ip ad 192.168.20.1 255.255.255.0
SW0(config-if)#no sh
SW0(config-if)#exit

SW0(config)#in vl 30
SW0(config-if)#ip ad 192.168.30.1 255.255.255.0
SW0(config-if)#no sh
SW0(config-if)#exit

SW0(config)#in f0/23
SW0(config-if)#no sw
SW0(config-if)#ip ad 10.1.1.1 255.255.255.0
SW0(config-if)#no sh
SW0(config-if)#exit

SW0(config)#in f0/24
SW0(config-if)#sw tr al vl 10,20,30
SW0(config-if)#end
SW0#sh vl br
SW0#sh ru

步骤三、R1配置IP地址
Router>en
Router#conf t
Router(config)#ho R1
R1(config)#in f0/0
R1(config-if)#ip ad 10.1.1.2 255.255.255.0
R1(config-if)#no sh
R1(config-if)#exit

R1(config)#in f0/1
R1(config-if)#ip ad 100.1.1.1 255.255.255.0
R1(config-if)#no sh
R1(config-if)#end
R1#sh ru


步骤四、SW0和R1配置路由
SW0>en
SW0#conf t
SW0(config)#ip route 0.0.0.0 0.0.0.0 10.1.1.2
SW0(config)#end
SW0#sh ip ro

R1#conf t
R1(config)#ip route 192.168.10.0 255.255.255.0 10.1.1.1
R1(config)#ip route 192.168.20.0 255.255.255.0 10.1.1.1
R1(config)#ip route 192.168.30.0 255.255.255.0 10.1.1.1
R1(config)#end
R1#sh ip ro

步骤五、SW0配置DHCP

SW0(config)#ip dhcp excluded-address 192.168.10.1    //DHCP地址池做排除
SW0(config)#ip dhcp excluded-address 192.168.20.1    //DHCP地址池做排除
SW0(config)#ip dhcp excluded-address 192.168.30.1    //DHCP地址池做排除
SW0(config)#ip dhcp excluded-address 192.168.40.1    //DHCP地址池做排除

SW0(config)#in vl 10
SW0(config-if)#ip routing
SW0(config)#ip dhcp pool 10                                             //创建VLAN10的DHCP地址池10
SW0(dhcp-config)#network 192.168.10.0 255.255.255.0  //设置DHCP地址池网段
SW0(dhcp-config)#default-router 192.168.10.1                //设置默认网关地址
SW0(dhcp-config)#dns-server 202.100.192.68                  //设置默认DNS地址
SW0(dhcp-config)#exit

SW0(config)#in vl 20
SW0(config-if)#ip routing
SW0(config)#ip dhcp pool 20
SW0(dhcp-config)#network 192.168.20.0 255.255.255.0
SW0(dhcp-config)#de
SW0(dhcp-config)#def 192.168.20.1
SW0(dhcp-config)#dns 202.100.192.68
SW0(dhcp-config)#exit

SW0(config)#in vl 30
SW0(config-if)#ip routing
SW0(config)#ip dhcp pool 30
SW0(dhcp-config)#network 192.168.30.0 255.255.255.0
SW0(dhcp-config)#de
SW0(dhcp-config)#def 192.168.30.1
SW0(dhcp-config)#dns 202.100.192.68
SW0(dhcp-config)#end
SW0#sh ru

步骤六、验证DHCP可以分配IP地址、网关和DNS

将PC1，PC2，PC3的IP Configuration 设置成DHCP自动获取

PC>ipconfig /release    //释放IP地址

   IP Address......................: 0.0.0.0
   Subnet Mask.....................: 0.0.0.0
   Default Gateway.................: 0.0.0.0
   DNS Server......................: 0.0.0.0

PC1>ipconfig /renew   //获取IP地址

   IP Address......................: 192.168.10.2
   Subnet Mask.....................: 255.255.255.0
   Default Gateway.................: 192.168.10.1
   DNS Server......................: 202.100.192.68

PC1>ping 100.1.1.2     //测试连通性

Pinging 100.1.1.2 with 32 bytes of data:

Reply from 100.1.1.2: bytes=32 time=1ms TTL=126
Reply from 100.1.1.2: bytes=32 time=0ms TTL=126
Reply from 100.1.1.2: bytes=32 time=0ms TTL=126
Reply from 100.1.1.2: bytes=32 time=0ms TTL=126

PC2和PC3同上




