 标准ACL

步骤一 配置交换接口IP
三层交换机（O）
Switch>en
Switch#vl da
Switch(vlan)#vl 10
Switch(vlan)#vl 20
Switch(vlan)#exit
Switch#conf t
 SW1(config)#ho SW1
 SW1(config)#in ra f0/1-10
 SW1(config-if-range)#sw mo ac
 SW1(config-if-range)#sw ac vl 10
 SW1(config-if-range)#exit
 SW1(config)#in ra f0/11-20
 SW1(config-if-range)#sw mo ac
 SW1(config-if-range)#sw ac vl 20
 SW1(config-if-range)#end
 SW1#sh vl

SW1#conf t
SW1(config)#in vl 10
SW1(config-if)#ip ad 192.168.1.1 255.255.255.0
SW1(config-if)no sh
SW1(config-if)#exit
SW1(config)#in vl 20
SW1(config-if)#ip ad 192.168.2.1 255.255.255.0
SW1(config-if)#exit
SW1(config)#in f0/24
SW1(config-if)#no sw //access模式转变为路由模式
SW1(config-if)#ip ad 192.168.3.1 255.255.255.0
SW1(config-if)#no sh
SW1(config-if)#exit
SW1(config)#ip routing  //开启三层交换机理由功能
SW1(config)#end
SW1#sh ru


步骤二 配置路由器的接口IP
R1接口IP配置并开启
Router>en
Router#conf t
Router(config)#ho R1

R1(config)#in f0/0
R1(config-if)#ip ad 192.168.3.2 255.255.255.0
R1(config-if)#no sh
R1(config)#in f0/1
R1(config-if)#ip ad 10.1.1.1 255.255.255.0
R1(config-if)#no sh
R1(config-if)#end
R1#sh ru

步骤三 验证测试连通性
PC1ping PC2
PC >ping 192.168.2.2     //通

PC1ping PC3
PC >ping 192.168.2.3    //通

PC1ping server0
PC >ping 10.1.1.2       //不通，应为没有配置路由

步骤四 配置路由
（1）配置交互机的路由
SW1#conf t
SW1(config)#ip route 0.0.0.0 0.0.0.0 192.168.3.2

(2)配置路由器的路由
R1#conf t
R1(config)#ip route 192.168.1.0 255.255.255.0 192.168.3.1
R1(config)#ip route 192.168.2.0 255.255.255.0 192.168.3.1

（3）观察交互机和路由器的路由

SW1(config)#end
SW1#sh ip ro

R1(config)#end
R1#sh ip ro

（4）验证测试PC和Server的连通性

PC1ping Server0
PC >ping 10.1.1.2    //通

PC2ping Server0
PC >ping 10.1.1.2    //通

PC3ping Server0
PC >ping 10.1.1.2    //通


步骤五 在路由器上配置ACL，只允许IP地址为192.168.1.0/24的所有计算机和192.168.2.2的计算机能够和访问服务器Server0

R1#conf t
R1(config)#access-list 2 permit 192.168.1.0 0.0.0.255 //允许源网络为192.168.1.0/24的所有主机 //简写 ac 2 pe 192.168.1.0 0.0.0.255 
R1(config)#access-list 2 permit host 192.168.2.2       //允许主机192.168.2.2 //简写ac 2 pe ho 192.168.2.2
R1(config)#access-list 2 deny any  //决绝所有IP，这是ACL的最后一条默认隐含命令// 简写 ac 2 de any

R1config)#in f0/1
Router(config-if)#ip access-group 2 out  //在接口f0/1的出口方向应用ACL
Router(config-if)#end
Router#sh ru
spanning-tree mode pvst
access-list 2 permit 192.168.1.0 0.0.0.255
access-list 2 permit host 192.168.2.2
access-list 2 deny any